<!DOCTYLE HTML>
<html>
 <head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>SoftGroup</title>
  <link href="main.css" rel="stylesheet" type="text/css"
 </head>
 
 <body>
<div class="page_align"> 
	<div class="header"> 
		<div class="header_I">
			<ul>
				<li><a href="index.php">  <h2>Головна</h2> </a> </li>
				<li><a href="Author.php"><h2> Автор </h2></a> </li>
				<li><a href="https://www.softgroup.ua/"> <h2>Soft Group <h2></a></li>
			</ul>
		</div>
	</div>
	
		<p> <img src="logo.png" alt="html">
</div>	
	

		
	<div class="sidebar">
		<div class="sidebar_I">
			<ul>
				<li><a href="zavd1.php">  <h3>Завдання 1</h3> </a> </li>
				<li><a href="zavd2.php">  <h3>Завдання 2</h3> </a> </li>
				<li><a href="zavd3.php">  <h3>Завдання 3</h3> </a> </li>
				<li><a href="#">  <h3>Завдання 4</h3> </a> </li>
				<li><a href="#">  <h3>Завдання 5</h3> </a> </li>
				<li><a href="#">  <h3>Завдання 6</h3> </a> </li>				
			</ul>
		</div>
	</div>
		
	</div>

	
	

				
	<div class="content"> 			
	<div class="content_I">
	<p><h1 align="center"><b> Soft Group </b></h1></p>
	</div>
	<div class="content_I">
	<h2 align="center">Перелік завдань</h2> 
	</div>
	<p><hr></p>
		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 1 </i> </h3> </p> 
		</div>
	<p>У форму вводиться число N. Знайти всі досконалі числа до N.
Досконале число - це таке число, що дорівнює сумі всіх своїх дільників,
крім себе самого. Наприклад, число 6 є досконалим, тому що крім себе
самого ділиться на числа 1, 2 і 3, які в сумі дають 6. </p>
<p><hr></p>
		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 2 </i> </h3> </p>
		</div>
	<p>У форму вводиться текст, слова в якому розділені пробілами і
розділовими знаками. Вилучити з цього тексту всі слова найбільшої
довжини. (Слів найбільшої довжини може бути декілька). </p>
<p><hr></p>
		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 3 </i> </h3> </p>
		</div>
	<p>Вводяться N натуральних чисел більше 2. Підрахувати, скільки серед
них простих чисел. </p>
<p><hr></p>
		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 4 </i> </h3> </p>
		</div>
	<p>Політичне життя однієї країни дуже жваве. У країні діє K політичних
партій, кожна з яких регулярно оголошує національний страйк. Дні, коли
хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя
(коли і так ніхто не працює), завдають великої шкоди економіці країни.
i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з
номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д.
Якщо в якийсь день кілька партій оголошує страйк, то це вважається
загальнонаціональним страйком.
У календарі країни N днів, пронумерованих від 1 до N. Перший день
року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається
з семи днів.</p>
<p><hr></p>
		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 5 </i> </h3> </p>
		</div>
	<p>Задано текст. Словом вважається послідовність непробільних символів,
які йдуть підряд. Слова розділені одним або більшим числом пробілів або
символами кінця рядка.
Для кожного слова з цього тексту підрахуйте, скільки разів воно
зустрічалося в цьому тексті раніше. Використайте словники.
 </p>
 <p><hr></p>
 		<div class="content_II">
	<p> <h3 align="center"> <i> Завдання 6 </i> </h3> </p>
		</div>
	<p>Змагання з гри «Тетріс-онлайн» проводяться за такими правилами:
Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена
учасників не повторюються.
Чемпіонат проводиться протягом певного часу. У будь-який момент цього
часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і
почати залікову гру. Після закінчення гри її результат (кількість балів)
фіксується і заноситься до протоколу.
Учасники мають право грати кілька разів. Кількість спроб одного учасника
не обмежується. Остаточний результат учасника визначається по одній грі,
кращою для даного учасника. Більш високе місце в змаганнях займає
учасник, що показав кращий результат. При рівності результатів більш
високе місце займає учасник, раніше показав кращий результат.
В ході змагань заповнюється протокол, кожен рядок якого описує одну гру
і містить результат учасника і його ігрове ім'я. Протокол формується в
реальному часі по ходу проведення чемпіонату, тому рядки в ньому
розташовані в порядку проведення ігор: чим раніше зустрічається рядок у
протоколі, тим раніше закінчилася відповідна цьому рядку гра.
Напишіть програму, яка за даними протоколу визначає переможця і
призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.
 </p>
	
	</div>
	<div class="crl"> </div>
	
	
<div class="end">
	<P> <h5 align="center"> &copy Гаврилюк Дмитро</h5></p>
	<P> <h5 align="center"> 2017</h5></p>
</div>
	
 </body>
</html>